
[Application]
==================================================

FlashBurn=烧录软件
Upgrade Kit=升级软件

DMR FlashBurn=DMR烧录软件
DMR FlashBurn Software=DMR 烧录软件
DMR UpgradeKit Software=DMR 升级软件


[Menu]
==================================================

Merge File=合并文件
Change Skin=换肤
Play Sound=播放声音
Skin1=皮肤1
Skin2=皮肤2
Skin3=皮肤3
About=关于
Exit=退出
Arm Version=主机阶段版本
Version R50=R50阶段
Version R46=R46阶段
Version R40=R40阶段
Subscriber=终端
Repeater=中转台

[Report]
====================================================

Burn=烧录
Command=命令
File=文件
Select=选择
Origin=起始地址
Length=长度
Extra Org=扩展地址
Extra Len=扩展长度

No=序号

Radio Model=对讲机型号:
Boot Version:=下载程序版本:

Burning Finished!=下载完成!

Radio=手持机
Portable=手持机
Mobile=车台
Repeater=中转台

Portable_trunking=手台集群
Mobile_trunking=车台集群

Other=其它

Please input file name!=请输入文件名!
Open USB failed!=打开USB失败!请选择一个可用端口!
Opening file failed!=打开文件失败!
fud file format error!=合并文件格式错误!
Reading data error!=读数据错误!
Writing data error!=写数据错误!
Checking data error!=检查数据错误!
Checking Finished (OK)!=检查完成(正确)!
Erasing Finished!=擦除完成!
Upgrading Finished!=升级完成!
erasing...=擦除...

Model type select error!=机型选择错误

 file does not exist!= 文件不存在!

Are you sure to burn %d files you select?=确定烧录所选择的%d个文件?

 read error!=读取错误!

Bootloader version is low! Please upgrade it!=Bootloader版本低，请升级bootloader!
The format of [%s] is not suited!=[%s]格式可能不相符!
Browse and open upgrade file=浏览和打开升级文件

Burning Bootloader Finished. Please Reboot Radio!=Bootloader烧录完成，请重启主机！

Restoration file of the radio SN[%s] already exists. Are you sure to restore from the file?=此序列号[%s]的恢复文件存在，是否要从文件恢复?

Upgrade Cancelled!=升级取消!
Read Restoration File:=读恢复文件：

Upgrade file of the radio does not exist. Will you select one?=此对讲机的升级文件不存在，是否要选择一个升级文件?
RCDB data is already saved to file, from you can restore your data when necessary.=已保存RCDB数据至文件，升级此对讲机请从此文件恢复！

Please burn the cps_data or rcdb_data last for safety purpose!=基与安全考虑，请把cps_data或者rcdb_data选择到最后烧录

Upgrade File:=升级文件:
The default value of %s is not suitable!=%s缺省值不合适!
Are you sure to continue burn?=确定继续烧录吗?

rcdb erasing...=擦除RCDB...

The firmware version [%s] is beyond the upgrade software!=读取的主机版本[%s]超出升级软件范围!

For Firmware Version:=适合主机版本:

Upgrade To:=升级至:

Please select file for burn!=请选择烧录的文件!
Note: Please use CPS to download language package after upgrade=注意：升级之后请用CPS软件下载区域语言包


[About]
=====================================================

OK=确 定
About=关于
Radio Model=对讲机类型

Version:=版本:
Copyright (C) 2005-2013  All Rights Reserved=版权所有 (2005-2016)
Hytera Communications Corporation Limited=海能达通信股份有限公司
All Rights Reserved=版权所有 (2005-2016)


[Merge File]
=====================================================

Generate=生成FUD
Merge=合并
Save File=保存文件名
Please input save file!=请输入保存的文件!
Merge File Successed!=合并文件成功!
Double click two reports to add or remove burn command=双击两个表格可增加或移除烧录的指令

Read=读取
Check=检查
Erase=擦除

Upgrade=升级
Burn=烧录
Burn All=烧录所有

Save Head Information=保存头部信息
Save Cps Data=保存写频数据

More Information=更多信息
Fud Information=Fud文件信息
File Size=文件大小

Save Head=保存头部
Save CPS=保存CPS
Fud File:=Fud文件:
The file already exists. overlay it?=此文件已存在，覆盖文件内容吗?

Modify=修改
Modify select row information=修改选择行信息
Version=版本

Firmware Ver=主机版本
Extern File=外部文件
Extend Name=扩展名称
[Menu]=[菜单]
USB Port=端口:


[Read]
=====================================================

Select Type=选择类型
Start Address=开始地址
Length=长度
Cancel=取消

Rx Radio of Repeater=中转台接收
File System Read Mode=文件系统模式
RCDB Format=RCDB格式
Save Text File=保存文本格式

Please input start address!=请输入开始地址!
Please input length!=请输入长度!



[For Radio]
=====================================================

Model=机型
Model Number=机型码
Firmware Version=主机版本



[Restore]
=======================================================

Restore Data=恢复数据
Backup Date=备份日期
Restore=恢复
Add=增加
Delete=删除
Serial Number=序列号
Date=日期
File Name=文件名
Path=路径
Delete the selected file [SN+ %s, Date+%s] ?=删除选择的记录文件[序列号=%s, 日期=%s]?
Please select a record to delete!=请选择删除的记录!


Example=例子
Input Example=输入例子

Note: Upgrade for all when set is null=说明: 当设置为空时则对应的所有项都适合

Firmware version format is error!=主机版本格式错误!
Model number format is error!=机型码格式错误!
Please input firmware version!=请输入主机版本号!
Please input model number!=请输入机型码!

Please input start address!=请输入起始地址!
Please input change data length!=请输入变化的数据个数!

have exist in merge list, please double click it to remove first!=已经存在合并列表中,请先双击移去!

No select don't save serial number and sales region when upgrade rcdb_data or cps_data or mac address of repeater!=不选择此项当升级rcdb_data或者cps_data时将不保存序列号和销售区域和中转台MAC地址!

Please sure change data dll is suitable when upgrade rcdb_data or cps_data!=请确定转换数据DLL是适合此版本的(当升级rcdb_data或者cps_data时)!

Extend Name (Version)=扩展名 (版本)

All=所有
Upgrade To Firmware Version=升级到主机版本
Firmware version format is error severity!=主机版本格式严重错误!

Upgrade to firmware version format is error severity!=升级到主机版本格式严重错误!
Upgrade to firmware version format is error!=升级到主机版本格式错误!

The model number [%s] is beyond the upgrade software!=机型[%s]超出升级文件允许范围!

The radio type [%s] is beyond the upgrade software!=对讲机类型[%s]超出升级文件允许范围!

Upgrade file of the radio does not exist!=升级文件不存在!

Include Serial Number, Sales Region, MAC Address of Repeater, Programmed Date=保存序列号、销售区域、中转台MAC地址、编程日期
Save all cps datas. example of use cps programming software=保存所有写频数据(例如用写频软件设置的)

Tuner Change use for cps_data, but cps_data not in Merge file!=调测变化用于cps_data,但cps_data未设置在合并文件中!

Model number format is error severity!=机型码格式严重错误!

For Radio=适合机型
For Radio2=适合类型
For Version=适合主机版本
For Model=适合机型
Tuner Change=调测改变

The extern file [%s] is not exist!=外部文件 [%s] 不存在!

rcdb file format error!=RCDB文件格式错误!

Can not change extern file check, please double click top grid to replace!=不能更改外部文件选项，请双击顶部表格替换!

have exist in merge list, are you sure to replace it?=已经存在合并列表中,确定要替换吗?

Extern file is not exist!=外部文件不存在!

Reading...=读取...
Read Finished!=读数据完成!

All Version=所有版本
Please Set For Radio!=请设置适合类型!
Because upgrade for rcdb data, please set For Model!=因有升级RCDB数据,请设置机型!
Note: Select rcdb_data to upgrade, the turn data of radio will lost when upgrade!=注意: 选择rcdb_data升级后将丢失对讲机的调测数据!

Note: you have not select save head information, will lost radio sn and sales region!=注意: 未选择保存头部信息，将失去序列号以及销售区域!

Number: %d=总数: %d
Software Version: =制作软件版本: 

The language package of portable is not match!=手台语言包不匹配!
The language package of mobile is not match!=车台语言包不匹配!
The language package of repeater is not match!=中转台语言包不匹配!

For radio is not match!=对讲机类型不匹配!

Delete the selected file [SN+ %s, Date+%s] ?Warning: sure to restore this radio from the file before delete it!=删除选择的记录文件[序列号=%s, 日期=%s]? 警告: 确定在删除前已恢复此对讲机！

Model number of filename and rcdb is not match!=文件名机型与rcdb机型不符!
Model number of filename and for model is not match!=文件名机型与适合机型不符!
Model number of rcdb and for model is not match!=适合机型与rcdb机型不符!

Save Cps Data <Dll For latest: =保存写频数据 <Dll适合最新版本:  

arm_main/erasing...=arm_main/正在擦除...
arm_main/writing...=arm_main/正在烧录...

dsp_boot/erasing...=dsp_boot/正在擦除...
dsp_boot/writing...=dsp_boot/正在烧录...

dsp_main/erasing...=dsp_main/正在擦除...
dsp_main/writing...=dsp_main/正在烧录...

dsp_main2/erasing...=dsp_main2/正在擦除...
dsp_main2/writing...=dsp_main2/正在烧录...

rcdb_data/reading...=rcdb_data/正在读取...

cps_data/reading...=cps_data/正在读取...
cps_data/writing...=cps_data/正在烧录...

bootloader/erasing...=bootloader/正在擦除...
bootloader/writing...=bootloader/正在烧录...

rcdb_data/writing...=rcdb_data/正在烧录...

english language/erasing...=english language/正在擦除...
english language/writing...=english language/正在烧录...

other language package/erasing...=other language package/正在擦除...
other language package/writing...=other language package/正在烧录...

gif package/erasing...=gif package/正在擦除...
gif package/writing...=gif package/正在烧录...

pic_gif package/erasing...=pic_gif package/正在擦除...
pic_gif package/writing...=pic_gif package/正在烧录...

fpga_code/erasing...=fpga_code/正在擦除...
fpga_code/writing...=fpga_code/正在烧录...

user_defined/erasing...=user_defined/正在擦除...
user_defined/writing...=user_defined/正在烧录...

arm_main(Rx)/erasing...=arm_main(Rx)/正在擦除...
arm_main(Rx)/writing...=arm_main(Rx)/正在烧录...

dsp_main(Rx)/erasing...=dsp_main(Rx)/正在擦除...
dsp_main(Rx)/writing...=dsp_main(Rx)/正在烧录...

dsp_boot(Rx)/erasing...=dsp_boot(Rx)/正在擦除...
dsp_boot(Rx)/writing...=dsp_boot(Rx)/正在烧录...

bootloader(Rx)/erasing...=bootloader(Rx)/正在擦除...
bootloader(Rx)/writing...=bootloader(Rx)/正在烧录...

read_rcdb/reading...=read_rcdb/正在读取...

user_defined(Rx)/erasing...=user_defined(Rx)/正在擦除...
user_defined(Rx)/writing...=user_defined(Rx)/正在烧录...

voice notify package/erasing...=voice notify package/正在擦除...
voice notify package/writing...=voice notify package/正在烧录...

For Repeater Subscriber To=适合中转台软件升级至
For Portable and Mobile Subscriber To=适合手台车台软件升级至
For Portable Subscriber To=适合手台软件升级至
For Mobile Subscriber To=适合车台软件升级至
For Portable and Mobile and Repeater Subscriber To=适合手台车台中转台软件升级至


Please input file name!=请输入文件名!
Reading =读取 

Burn Command=烧录命令
The connected radio is not repeater, but select (Rx) command, continue burn?=连接的不是中转台却选择了接收命令，继续烧录吗?

Burn Cancelled!=烧录取消!
 
Burn Failed!=烧录失败!

Are you sure to erase the [%s] data?=确定要擦除[%s]数据吗?
Erasing Finished, Please reset the radio after erase rcdb data!=擦除完成，擦除RCDB数据后需要重新开机!

Read data finished!=读数据完成!
Read data and save file finished!=读数据和保存文件完成!

Checking...=正在检查...

Now is burning, Are you sure to exit the programme?=正在烧录中，确定要退出程序吗?


Now is operating, Are you sure to exit the programme?=正在操作中，确定要退出程序吗?
Now is erasing, Are you sure to exit the programme?=正在擦除中，确定要退出程序吗?
Now is reading, Are you sure to exit the programme?=正在读取中，确定要退出程序吗?
Now is checking, Are you sure to exit the programme?=正在检查中，确定要退出程序吗?

Memory is not enough!=内存不足!

File does not exist!=文件不存在!

Check Error Address=检查错误地址
Ingore A/S Version=忽略A/S版本

A Version only to upgrade A Version, and S Version only to upgrade S Version, when the check not selected=未勾选时，A版本只允许升级A版程序，S版本只允许升级S版程序

A/S Version [%s] is beyond the upgrade software!=A/S版本[%s]超出升级软件允许范围!

For Serial Number=适合序列号

Fud file version error!=Fud文件版本错误!

The serial number [%s] is beyond the upgrade file!=序列号[%s]超出升级文件允许范围!

Please input serial number!=请输入序列号!

For All Region=适用所有区域
For China=适用中国区
For North America=适用北美区
For EMEA=适用EMEA
For South America=适用南美区
For ASIAN=适用亚太区

Please burn the bootloader last for safety purpose!=基与安全考虑，请把bootloader选择到最后烧录

Not select save cps data when select rcdb_data!=当选则rcdb_data时不能选择保存写频数据选项!

Merge File List=合并文件列表

For PDT Subscriber To=适合集群软件升级至

The radio sn [%s] is beyond the upgrade software!=对讲机序列号[%s]不在升级软件范围内!

Number=个数
Note:=注意:
The length of arm_main is 0x440000, suitable for DMR R4.5 and Later.=arm_main长度为0x440000,适合DMR R4.5及以后的主机版本.

If burn arm_main of R4.0 and early, =如果要烧录R4.0及之前的版本, 
Please use Flashburn V3.00.04.000 and early.=请使用FlashBurn V3.00.04.000及之前的版本.

Not Tip Later=不再提示
Tips=提示

Delete All=删除所有
From File=来自文件

Low Band=低频
High Band (For U5)=高频 (适合U5)

Warning: bootloader file is not suited, be likely to dismantle radio, continue to burn?=警告: bootloader文件不合适,可能导致拆机后果,是否继续烧录?

Please Set Mode!=请设置模式!
Please Set Type!=请设置类型!
Set Mode=设置模式
Set Type=请设置类型
Convention=常规
Trunking=集群

Merge All=批量合并
Language=烧录语言
Default=默认方案
Farsi=波斯语
Arabic=阿拉伯语
Korean=韩语
Thai=泰语
Japanese=日语
Forest=林业

SetPDTDMR=空口模式
DefaultMode=默认模式
PDTMode=PDT 模式
DMRMode=DMR 模式

Please upgrade system after subsrible.=升级完终端之后，需要升级匹配的系统，继续吗？
Not save cps data.=升级将会重置数据，继续吗？

Backup File Storage Path=备份文件存储路径
Please select the backup file storage path!=请选择备份文件存储路径！
Data has been corrupted!=数据已被破坏！
Data has been corrupted, select the backup file!=数据已被破坏，请选择备份文件！
Data conversion failed, please re-upgrade!=数据转换失败，请重新升级!
Data validation fails, please re-upgrade!=数据校验失败，请重新升级!
Upgrade components is incorrect, please re-install the upgrade program!=升级组件不正确，请重新安装升级程序！

[NEW]
=======================================================
JSON input data parsing failed!=JSON输入数据解析失败！
Undetectable download mode USB port!=检测不到下载模式的USB端口！
Open USB failed!=打开USB失败!
Get bootloader version fails!=获取bootloader版本失败！
Upgrade components is incorrect, please re-install the upgrade program!=升级组件不正确，请重新安装升级程序！
Reading data error[{0}]!=读数据错误[{0}]!
RCDB file format error!=RCDB文件格式错误！
The radio type [{0}] is beyond the upgrade software!=对讲机类型[{0}]超出升级文件允许范围!
The model number [{0}] is beyond the upgrade software!=机型码[{0}]超出升级文件允许范围!
The firmware version [{0}] is beyond the upgrade software!=读取的主机版本[{0}]超出升级软件范围!
Customer code is beyond the upgrade software!=客户编码超出升级软件范围！
Upgrade components is incorrect, please re-install the upgrade program.=升级组件不正确，请重新安装升级程序。
Opening file [{0}] failed!=打开文件[{0}]失败!
FUD file [{0}] format error!=FUD文件[{0}]格式错误!
Data conversion failed, please re-upgrade!=数据转换失败，请重新升级!
The extern file [{0}] is not exist!=外部文件 [{0}] 不存在!
Reading data error!=读数据错误!
Opening file [{0}] failed.=打开文件[{0}]失败。
Upgrading Finished!=升级完成!
Upgrade Failed = 升级失败!
RCDB data is already saved to file, from you can restore your data when necessary.=写数据错误！已保存RCDB数据至文件，升级请从此文件恢复！
Automatic download mode failure, please manually enter the download mode.=自动进入下载模式失败，请手动进入下载模式。


arm_main/erasing...=AM/正在擦除...
arm_main/writing...=AM/正在烧录...

dsp_boot/erasing...=DB/正在擦除...
dsp_boot/writing...=DB/正在烧录...

dsp_main/erasing...=DM/正在擦除...
dsp_main/writing...=DM/正在烧录...

dsp_main2/erasing...=DM2/正在擦除...
dsp_main2/writing...=DM2/正在烧录...

rcdb_data/reading...=RD/正在读取...

cps_data/reading...=CD/正在读取...
cps_data/writing...=CD/正在烧录...

bootloader/erasing...=BL/正在擦除...
bootloader/writing...=BL/正在烧录...

bootloader_secondary/erasing...=BLS/正在擦除...
bootloader_secondary/writing...=BLS/正在烧录...

rcdb_data/writing...=RD/正在烧录...

english language/erasing...=EL/正在擦除...
english language/writing...=EL/正在烧录...

other language package/erasing...=OL/正在擦除...
other language package/writing...=OL/正在烧录...

gif package/erasing...=GP/正在擦除...
gif package/writing...=GP/正在烧录...

pic_gif package/erasing...=PG/正在擦除...
pic_gif package/writing...=PG/正在烧录...

fpga_code/erasing...=FC/正在擦除...
fpga_code/writing...=FC/正在烧录...

user_defined/erasing...=正在擦除...
user_defined/writing...=正在烧录...

arm_main(Rx)/erasing...=AMR/正在擦除...
arm_main(Rx)/writing...=AMR/正在烧录...

dsp_main(Rx)/erasing...=DMR/正在擦除...
dsp_main(Rx)/writing...=DMR/正在烧录...

dsp_boot(Rx)/erasing...=DBR/正在擦除...
dsp_boot(Rx)/writing...=DBR/正在烧录...

bootloader(Rx)/erasing...=BLR/正在擦除...
bootloader(Rx)/writing...=BLR/正在烧录...

bootloader_secondary(Rx)/erasing...=BLSR/正在擦除...
bootloader_secondary(Rx)/writing...=BLSR/正在烧录...

read_rcdb/reading...=RR/正在读取...

user_defined(Rx)/erasing...=正在擦除...
user_defined(Rx)/writing...=正在烧录...

voice notify package/erasing...=VN正在擦除...
voice notify package/writing...=VN正在烧录...































